# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumericRevisionSettings..::..IsEqual Method
NumericRevisionSettings Class See Also
---
Determines whether a specified NumericRevisionSettings is the same as 'this'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsEqual(
	NumericRevisionSettings other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As NumericRevisionSettings _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	NumericRevisionSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..NumericRevisionSettings The specified NumericRevisionSettings with which to compare.
# ### Return Value
True, if two NumericRevisionSettings are the same.
# Remarks
The two NumericRevisionSettings are regarded as the same only if they have the same start number, prefix and suffix strings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace